<a href="https://colab.research.google.com/github/SilahicAmil/30-Days-Of-ML/blob/main/Day_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# Dataframes

Dataframes are the pandas work horse. Dataframe is like a bunch of series objects put together

In [4]:
from numpy.random import randn
np.random.seed(42)

In [6]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
C -0.600639 -0.291694 -0.601707  1.852278
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

In [7]:
df['W']

A    1.465649
B   -0.544383
C   -0.600639
D   -0.013497
E    0.208864
Name: W, dtype: float64

In [10]:
# List of columns names
df[["W", "Z"]]

          W         Z
A  1.465649 -1.424748
B -0.544383  0.375698
C -0.600639  1.852278
D -0.013497 -1.220844
E  0.208864  0.196861

In [11]:
# SQL Syntaxing (not a very proper way of doing things)
df.W

A    1.465649
B   -0.544383
C   -0.600639
D   -0.013497
E    0.208864
Name: W, dtype: float64

In [13]:
# As stated before Dataframes are a bunch of series objects
type(df["W"])

pandas.core.series.Series

## Creating new column

In [14]:
df["new"] = df["W"] + df["X"]
df

          W         X         Y         Z       new
A  1.465649 -0.225776  0.067528 -1.424748  1.239872
B -0.544383  0.110923 -1.150994  0.375698 -0.433460
C -0.600639 -0.291694 -0.601707  1.852278 -0.892332
D -0.013497 -1.057711  0.822545 -1.220844 -1.071208
E  0.208864 -1.959670 -1.328186  0.196861 -1.750807

## Removing Column

In [15]:
df.drop("new", axis=1)

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
C -0.600639 -0.291694 -0.601707  1.852278
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

In [17]:
# Not saved aka inplace since didnt specify it
df

          W         X         Y         Z       new
A  1.465649 -0.225776  0.067528 -1.424748  1.239872
B -0.544383  0.110923 -1.150994  0.375698 -0.433460
C -0.600639 -0.291694 -0.601707  1.852278 -0.892332
D -0.013497 -1.057711  0.822545 -1.220844 -1.071208
E  0.208864 -1.959670 -1.328186  0.196861 -1.750807

In [18]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
C -0.600639 -0.291694 -0.601707  1.852278
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

## Dropping Rows

In [19]:
# Axis 0 = Row
# Axis 1 = Column
df.drop("C", axis=0)

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

## Selecting Rows

In [20]:
df.loc["A"]

W    1.465649
X   -0.225776
Y    0.067528
Z   -1.424748
Name: A, dtype: float64

In [21]:
# Position selection
df.iloc[2]

W   -0.600639
X   -0.291694
Y   -0.601707
Z    1.852278
Name: C, dtype: float64

## Subset of rows and columns

In [22]:
df.loc["B", "Y"]

-1.1509935774223028

In [23]:
df.loc[["A", "B"], ["W", "Y"]]

          W         Y
A  1.465649  0.067528
B -0.544383 -1.150994

## Conditional Selection

Bracket notation similar to numpy

In [24]:
df

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
B -0.544383  0.110923 -1.150994  0.375698
C -0.600639 -0.291694 -0.601707  1.852278
D -0.013497 -1.057711  0.822545 -1.220844
E  0.208864 -1.959670 -1.328186  0.196861

In [25]:
df > 0

       W      X      Y      Z
A   True  False   True  False
B  False   True  False   True
C  False  False  False   True
D  False  False   True  False
E   True  False  False   True

In [26]:
df[df > 0]

          W         X         Y         Z
A  1.465649       NaN  0.067528       NaN
B       NaN  0.110923       NaN  0.375698
C       NaN       NaN       NaN  1.852278
D       NaN       NaN  0.822545       NaN
E  0.208864       NaN       NaN  0.196861

In [28]:
df[df["W"] > 0]

          W         X         Y         Z
A  1.465649 -0.225776  0.067528 -1.424748
E  0.208864 -1.959670 -1.328186  0.196861

In [30]:
df[df['W'] > 0]['Y']

A    0.067528
E   -1.328186
Name: Y, dtype: float64

In [32]:
df[df['W'] > 0][['Y','X']]

          Y         X
A  0.067528 -0.225776
E -1.328186 -1.959670

In [33]:
df[(df['W'] > 0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

# Multi Index and Hierachy

In [36]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [38]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.738467  0.171368
   2 -0.115648 -0.301104
   3 -1.478522 -0.719844
G2 1 -0.460639  1.057122
   2  0.343618 -1.763040
   3  0.324084 -0.385082

In [39]:
df.loc['G1']

          A         B
1  0.738467  0.171368
2 -0.115648 -0.301104
3 -1.478522 -0.719844

In [40]:
df.loc['G1'].loc[1]

A    0.738467
B    0.171368
Name: 1, dtype: float64

In [41]:
df.index.names

FrozenList([None, None])

In [42]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1    0.738467  0.171368
      2   -0.115648 -0.301104
      3   -1.478522 -0.719844
G2    1   -0.460639  1.057122
      2    0.343618 -1.763040
      3    0.324084 -0.385082

In [43]:
df.xs('G1')

            A         B
Num
1    0.738467  0.171368
2   -0.115648 -0.301104
3   -1.478522 -0.719844

In [44]:
df.xs(['G1', 1])

A    0.738467
B    0.171368
Name: (G1, 1), dtype: float64

In [45]:
df.xs(1, level='Num')

              A         B
Group
G1     0.738467  0.171368
G2    -0.460639  1.057122